In [2]:
!c:/Users/andre/OneDrive/Documentos/Private/Salerno/Pessoal/Cursos/datacamp/pandas/.venv/Scripts/Activate.ps1

In [3]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\andre\onedrive\documentos\private\salerno\pessoal\cursos\datacamp\pandas\.venv\lib\site-packages (2.0.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\andre\onedrive\documentos\private\salerno\pessoal\cursos\datacamp\pandas\.venv\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\andre\onedrive\documentos\private\salerno\pessoal\cursos\datacamp\pandas\.venv\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: tzdata>=2022.1 in c:\users\andre\onedrive\documentos\private\salerno\pessoal\cursos\datacamp\pandas\.venv\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in c:\users\andre\onedrive\documentos\private\salerno\pessoal\cursos\datacamp\pandas\.venv\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in c:\users\andre\onedrive\documentos\private\salerno\pessoal\cursos\datacamp\pandas\.venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [4]:
import pickle

In [5]:
import pandas as pd

In [6]:
taxi_owners = pd.read_pickle('../pandas/datasets/taxi_owners.p')

In [7]:
taxi_owners.shape

(3519, 5)

In [8]:
taxi_owners.head(2)

     rid   vid           owner                 address    zip
0  T6285  6285  AGEAN TAXI LLC     4536 N. ELSTON AVE.  60630
1  T4862  4862    MANGIB CORP.  5717 N. WASHTENAW AVE.  60659

In [9]:
taxi_veh = pd.read_pickle('../pandas/datasets/taxi_vehicles.p')

In [10]:
taxi_veh.shape

(3519, 6)

In [11]:
taxi_veh.head(2)

    vid    make  model  year fuel_type           owner
0  2767  TOYOTA  CAMRY  2013    HYBRID  SEYED M. BADRI
1  1411  TOYOTA   RAV4  2017    HYBRID     DESZY CORP.

In [12]:
taxi_veh.groupby('fuel_type').nunique()

                         vid  make  model  year  owner
fuel_type
COMPRESSED NATURAL GAS    27     3      3     4     19
FLEX FUEL                 89     7     11     9     73
GASOLINE                 611    12     37     9    498
HYBRID                  2792     8     20    12   1877

In [13]:
# Merge the taxi_owners and taxi_veh tables
# A length-2 sequence where each element is optionally a string indicating the suffix to add # to overlapping column names in left and right respectively. 
taxi_own_veh = taxi_owners.merge(taxi_veh, on='vid', suffixes=('_own', '_veh'))
print(taxi_own_veh)

        rid   vid         owner_own                 address    zip    make
0     T6285  6285    AGEAN TAXI LLC     4536 N. ELSTON AVE.  60630  NISSAN  \
1     T4862  4862      MANGIB CORP.  5717 N. WASHTENAW AVE.  60659   HONDA
2     T1495  1495     FUNRIDE, INC.     3351 W. ADDISON ST.  60618  TOYOTA
3     T4231  4231      ALQUSH CORP.   6611 N. CAMPBELL AVE.  60645  TOYOTA
4     T5971  5971    EUNIFFORD INC.     3351 W. ADDISON ST.  60618  TOYOTA
...     ...   ...               ...                     ...    ...     ...
3514  T4453  4453   IMAGIN CAB CORP     3351 W. ADDISON ST.  60618    FORD
3515   T121   121  TRIBECA CAB CORP     4536 N. ELSTON AVE.  60630    FORD
3516  T3465  3465  AMIR EXPRESS INC     3351 W. ADDISON ST.  60618  TOYOTA
3517  T1962  1962  KARY CAB COMPANY     4707 N. KENTON AVE.  60630  TOYOTA
3518  T1031  1031       NECT 42 LLC    6500 N. WESTERN AVE.  60645    FORD

       model  year fuel_type         owner_veh
0     ALTIMA  2011    HYBRID    AGEAN TAXI LLC
1        CRV  2014  GASOLINE      MANGIB CORP.
2     SIENNA  2015  GASOLINE     FUNRIDE, INC.
3      CAMRY  2014    HYBRID      ALQUSH CORP.
4     SIENNA  2015  GASOLINE    EUNIFFORD INC.
...      ...   ...       ...               ...
3514  ESCAPE  2010    HYBRID   IMAGIN CAB CORP
3515   C-MAX  2014    HYBRID  TRIBECA CAB CORP
3516   CAMRY  2014    HYBRID  AMIR EXPRESS INC
3517   CAMRY  2014    HYBRID  KARY CAB COMPANY
3518  FUSION  2014    HYBRID       NECT 42 LLC

[3519 rows x 10 columns]

In [14]:
taxi_own_veh['fuel_type'].value_counts()

fuel_type
HYBRID                    2792
GASOLINE                   611
FLEX FUEL                   89
COMPRESSED NATURAL GAS      27
Name: count, dtype: int64

In [15]:
wards = pd.read_pickle('../pandas/datasets/ward.p')
wards.head()

  ward            alderman                          address    zip
0    1  Proco "Joe" Moreno        2058 NORTH WESTERN AVENUE  60647
1    2       Brian Hopkins       1400 NORTH  ASHLAND AVENUE  60622
2    3          Pat Dowell          5046 SOUTH STATE STREET  60609
3    4    William D. Burns  435 EAST 35TH STREET, 1ST FLOOR  60616
4    5  Leslie A. Hairston            2325 EAST 71ST STREET  60649

In [16]:
census = pd.read_pickle('../pandas/datasets/census.p')
census.head()

,ward,pop_2000,pop_2010,change,address,zip
0,1,52951,56149,6%,2765 WEST SAINT MARY STREET,60647
1,2,54361,55805,3%,WM WASTE MANAGEMENT 1500,60622
2,3,40385,53039,31%,17 EAST 38TH STREET,60653
3,4,51953,54589,5%,31ST ST HARBOR BUILDING LAKEFRONT TRAIL,60653
4,5,55302,51455,-7%,JACKSON PARK LAGOON SOUTH CORNELL DRIVE,60637

In [17]:
wards_census = wards.merge(census, on= 'ward')
print('wards_census table shape:', wards_census.shape)

wards_census table shape: (50, 9)

In [18]:
import numpy as np

In [19]:
wards_altered = wards
wards_altered['ward'][[0]] = 61

In [20]:
wards_altered

   ward                   alderman                            address    zip
0    61         Proco "Joe" Moreno          2058 NORTH WESTERN AVENUE  60647
1     2              Brian Hopkins         1400 NORTH  ASHLAND AVENUE  60622
2     3                 Pat Dowell            5046 SOUTH STATE STREET  60609
3     4           William D. Burns    435 EAST 35TH STREET, 1ST FLOOR  60616
4     5         Leslie A. Hairston              2325 EAST 71ST STREET  60649
5     6         Roderick T. Sawyer   8001 S. MARTIN LUTHER KING DRIVE  60619
6     7        Gregory I. Mitchell              2249 EAST 95TH STREET  60617
7     8         Michelle A. Harris    8539 SOUTH COTTAGE GROVE AVENUE  60619
8     9           Anthony A. Beale                34 EAST 112TH PLACE  60628
9    10      Susan Sadlowski Garza           10500 SOUTH EWING AVENUE  60617
10   11     Patrick Daley Thompson          3659 SOUTH HALSTED STREET  60609
11   12            George Cardenas           3476 SOUTH ARCHER AVENUE  60608
12   13                Marty Quinn            6500 SOUTH PULASKI ROAD  60629
13   14            Edward M. Burke              2650 WEST 51ST STREET  60632
14   15           Raymond A. Lopez              1650 WEST 63RD STREET  60636
15   16            Toni L. Foulkes              3045 WEST 63RD STREET  60629
16   17             David H. Moore          7313 SOUTH ASHLAND AVENUE  60636
17   18          Derrick G. Curtis            8359 SOUTH PULASKI ROAD  60652
18   19          Matthew J. O'Shea         10400 SOUTH WESTERN AVENUE  60643
19   20          Willie B. Cochran    6357 SOUTH COTTAGE GROVE AVENUE  60637
20   21    Howard B. Brookins, Jr.  9011 SOUTH ASHLAND AVENUE, UNIT B  60620
21   22              Ricardo Munoz        2500 SOUTH ST. LOUIS AVENUE  60623
22   23        Michael R. Zalewski           6247 SOUTH ARCHER AVENUE  60638
23   24         Michael Scott, Jr.           1158 SOUTH KEELER AVENUE  60624
24   25       Daniel "Danny" Solis      1800 SOUTH BLUE ISLAND AVENUE  60608
25   26          Roberto Maldonado          2511 WEST DIVISION STREET  60622
26   27        Walter Burnett, Jr.             4 NORTH WESTERN AVENUE  60612
27   28             Jason C. Ervin              2602 WEST 16TH STREET  60612
28   29           Chris Taliaferro             6272 WEST NORTH AVENUE  60639
29   30          Ariel E. Reyboras        3559 NORTH MILWAUKEE AVENUE  60641
30   31  Milagros "Milly" Santiago            2521 NORTH PULASKI ROAD  60639
31   32           Scott Waguespack         2657 NORTH CLYBOURN AVENUE  60614
32   33               Deborah Mell         3001 WEST IRVING PARK ROAD  60618
33   34           Carrie M. Austin              507 WEST 111TH STREET  60628
34   35        Carlos Ramirez-Rosa           2710 NORTH SAWYER AVENUE  60647
35   36           Gilbert Villegas                 6934 WEST DIVERSEY  60607
36   37              Emma M. Mitts           4924 WEST CHICAGO AVENUE  60651
37   38           Nicholas Sposato          3821  NORTH HARLEM AVENUE  60634
38   39           Margaret Laurino          4404 WEST LAWRENCE AVENUE  60630
39   40        Patrick J. O'Connor          5850 NORTH LINCOLN AVENUE  60659
40   41      Anthony V. Napolitano           7442 NORTH HARLEM AVENUE  60631
41   42             Brendan Reilly   325 WEST HURON STREET, SUITE 510  60654
42   43             Michelle Smith          2523 NORTH HALSTED STREET  60614
43   44                 Tom Tunney        3223 NORTH SHEFFIELD AVENUE  60657
44   45              John S. Arena        4754 NORTH MILWAUKEE AVENUE  60630
45   46            James Cappleman         4544 NORTH BROADWAY AVENUE  60640
46   47                Ameya Pawar          4243 NORTH LINCOLN AVENUE  60618
47   48             Harry Osterman         5533 NORTH BROADWAY AVENUE  60640
48   49                  Joe Moore        7356 NORTH GREENVIEW AVENUE  60626
49   50       Debra L. Silverstein    2949 WEST DEVON AVENUE, SUITE A  60659

In [21]:
wards_altered_census = wards_altered.merge(census, on = 'ward')

In [22]:
print('wards_altered_census table shape:', wards_altered_census.shape)

wards_altered_census table shape: (49, 9)

In [23]:
wards_altered_census.head(2)

,ward,alderman,address_x,zip_x,pop_2000,pop_2010,change,address_y,zip_y
0,2,Brian Hopkins,1400 NORTH ASHLAND AVENUE,60622,54361,55805,3%,WM WASTE MANAGEMENT 1500,60622
1,3,Pat Dowell,5046 SOUTH STATE STREET,60609,40385,53039,31%,17 EAST 38TH STREET,60653

In [24]:
biz_owners = pd.read_pickle("../pandas/datasets/business_owners.p")
biz_owners.columns

Index(['account', 'first_name', 'last_name', 'title'], dtype='object')

In [25]:
licenses = pd.read_pickle('../pandas/datasets/licenses.p')
licenses.columns

Index(['account', 'ward', 'aid', 'business', 'address', 'zip'], dtype='object')

In [26]:
licenses_owners = licenses.merge(biz_owners, on='account')

In [27]:
counted_df = licenses_owners.groupby('title').agg({'account': 'count'})

In [28]:
sorted_df = counted_df.sort_values(by=['account'], ascending=False)

In [29]:
print(sorted_df.head())

                 account
title
PRESIDENT           6259
SECRETARY           5205
SOLE PROPRIETOR     1658
OTHER               1200
VICE PRESIDENT       970

In [30]:
zip_demo = pd.read_pickle('../pandas/datasets/zip_demo.p')
zip_demo.columns

Index(['zip', 'income'], dtype='object')

In [31]:
licenses.columns

Index(['account', 'ward', 'aid', 'business', 'address', 'zip'], dtype='object')

In [32]:
licenses_zip_ward = licenses.merge(zip_demo, on = 'zip')\
    .merge(wards, on='ward')

In [33]:
print(licenses_zip_ward.groupby(['alderman']).agg({'income': 'median'}))

                             income
alderman
Ameya Pawar                 66246.0
Anthony A. Beale            38206.0
Anthony V. Napolitano       82226.0
Ariel E. Reyboras           41307.0
Brendan Reilly             110215.0
Brian Hopkins               87143.0
Carlos Ramirez-Rosa         66246.0
Carrie M. Austin            38206.0
Chris Taliaferro            55566.0
Daniel "Danny" Solis        41226.0
David H. Moore              33304.0
Deborah Mell                66246.0
Debra L. Silverstein        50554.0
Derrick G. Curtis           65770.0
Edward M. Burke             42335.0
Emma M. Mitts               36283.0
George Cardenas             33959.0
Gilbert Villegas            41307.0
Gregory I. Mitchell         24941.0
Harry Osterman              45442.0
Howard B. Brookins, Jr.     33304.0
James Cappleman             79565.0
Jason C. Ervin              41226.0
Joe Moore                   39163.0
John S. Arena               70122.0
Leslie A. Hairston          28024.0
Margaret Laurino            70122.0
Marty Quinn                 67045.0
Matthew J. O'Shea           59488.0
Michael R. Zalewski         42335.0
Michael Scott, Jr.          31445.0
Michelle A. Harris          32558.0
Michelle Smith             100116.0
Milagros "Milly" Santiago   41307.0
Nicholas Sposato            62223.0
Pat Dowell                  46340.0
Patrick Daley Thompson      41226.0
Patrick J. O'Connor         50554.0
Raymond A. Lopez            33959.0
Ricardo Munoz               31445.0
Roberto Maldonado           68223.0
Roderick T. Sawyer          32558.0
Scott Waguespack            68223.0
Susan Sadlowski Garza       38417.0
Tom Tunney                  88708.0
Toni L. Foulkes             27573.0
Walter Burnett, Jr.         87143.0
William D. Burns           107811.0
Willie B. Cochran           28024.0

In [34]:
land_use = pd.read_pickle('../pandas/datasets/land_use.p')
land_use.columns

Index(['ward', 'residential', 'commercial', 'industrial', 'vacant', 'other'], dtype='object')

In [35]:
land_cen_lic = land_use.merge(census, on='ward')\
    .merge(licenses, on='ward', suffixes=('_cen', '_lic'))
land_cen_lic.columns

Index(['ward', 'residential', 'commercial', 'industrial', 'vacant', 'other',
       'pop_2000', 'pop_2010', 'change', 'address_cen', 'zip_cen', 'account',
       'aid', 'business', 'address_lic', 'zip_lic'],
      dtype='object')

In [36]:
census.columns

Index(['ward', 'pop_2000', 'pop_2010', 'change', 'address', 'zip'], dtype='object')

In [37]:
pop_vac_lic = land_cen_lic.groupby(['ward', 'pop_2010', 'vacant'], as_index=False).agg({'account': 'count'})

In [38]:
pop_vac_lic

   ward  pop_2010  vacant  account
0     1     56149       2      253
1    10     51535      14      130
2    11     51497       5      201
3    12     52235       4      255
4    13     53722       1      101
5    14     54031       3      202
6    15     51501       6      103
7    16     51954      13      156
8    17     51846       5      109
9    18     52992       3      124
10   19     51525       0      125
11    2     55805       2      301
12   20     52372      15      123
13   21     51632       5      123
14   22     53515       7      156
15   23     53728       1      147
16   24     54909      13       98
17   25     54539       5      321
18   26     53516       2      175
19   27     52939       7      497
20   28     55199      11      189
21   29     55267       2      154
22    3     53039      13      173
23   30     55560       1      186
24   31     53724       0      173
25   32     55184       1      248
26   33     55598       1      208
27   34     51599       7       99
28   35     55281       1      169
29   36     54766       1      145
30   37     51538       6      173
31   38     56001       0      136
32   39     55882       1      219
33    4     54589       7      160
34   40     55319       0      194
35   41     55991       0      153
36   42     55870       1     1371
37   43     56170       1      232
38   44     56058       0      238
39   45     55967       0      217
40   46     53784       1      143
41   47     55074       0      275
42   48     55014       1      156
43   49     54633       0      111
44    5     51455       3      104
45   50     55809       1      168
46    6     52341       8      149
47    7     51581      19       80
48    8     51687       5      176
49    9     51519       6      101

In [40]:
# Sort pop_vac_lic and print the results
sorted_pop_vac_lic = pop_vac_lic.sort_values(['vacant', 'account', 'pop_2010'], ascending=[False, True, True])

# Print the top few rows of sorted_pop_vac_lic
print(sorted_pop_vac_lic.head())

   ward  pop_2010  vacant  account
47    7     51581      19       80
12   20     52372      15      123
1    10     51535      14      130
16   24     54909      13       98
7    16     51954      13      156